using System.Diagnostics.CodeAnalysis;

namespace ConsoleApp1
{
    internal class Program
    {
        static void Main(string[] args)
        {
            //Console.WriteLine("Hello, World!");
            /*
             * Все в C# является объектом.
             * Сщуности/типы данных в С# делятся на 2 типа:
             * 1. Значимые (хранятся в стеке явлются экземпляроми структурой)
             * 2. Ссылочные (хранятсяв куче, являются экземплярами классов).
             * 
             * 
             * Типы данных:
             * 1. Значимые:
             * Целочисленные:
             * byte - 0-255
             * sbyte - -128-127
             * short - -32768-32767
             * ushort - 0 -65535
             * int целое число (32 бит)
             * uint целое число без знака
             * long целое число 64 бит
             * ulong целое число 64 бита без знака
             * 
             * Числа с плавающей точкой:
             * float -32 бита
             * double - 64 бита
             * decimal - 128 бит
             * 
             * --------
             * Символьный тип данных:
             * char
             * --------
             * Логический тип данных - bool
             * !!! true не всегда равно 1, так как тут неявное преобразование.
             * bool тип не является целочисленным типом под капотом. 
             * 
             * 2. Ссылочные (nullable)
             * null - отсутствие значения.
             * nullable типы - типы данных, у которых значения по умоляанию = null, т. е
             * если не на что ссылаться, то мы говорим, что у нас пустота.
             * 
             * string - строка.
             * классы
             */
            //int num = 12;
            //string str = "ssadsad";
            //double d = 12.5;//d - литерал double
            //float f = 12.5f;//f -литерал float
            //decimal de = 12.5m; //m - литерал  decimal
            //long l = 12;

            /*
             * 1. Переменные называем так, чтобы понимать они будут делать.
             * 2. Локальные переменные называем в camelCase.
             * 3. Публичные объекты (переменные, поля), классы методы свойства,events, делегаты в PascalCase.
             * 4. Приватные поля пишем в camelCase c_ в начале. _moneyCount.
             * 5. Сначала идут приватные значения, потом публичные значения,потом конструкторы,потом все методы(приватные первые).
             * 6. В рабоах должно быть приглашение к вводу.
             */
            // вывод
            //Console.WriteLine("sfgsshsfjsf"); // переносит строку (в конце ставится std::endl)
            //Console.Write(str); //не переносит строку
            //// ввод
            //string st = Console.ReadLine();
            //int ch = Console.Read(); // Читает символ и возвращает его код

            /*
             * Преоьразование типов:
             * 1. Неявное - когда мы не указываем тип в ктоторый преобразуем сами.
             * 2. Явное - когда мы сами указываем в какой тип преобразовывать.
             */

            // Неявное
            //int num = 5;

            //float f = num;
            //// Явное
            //double d = 14.6;
            //int di = (int)d;

            /*
             * Есть несколько способов для явного преобразования.
             * 1. (тип в который преобразуем) переменная которую преобиразуем.
             * Пример:
             *  double d = 14.6;
             *  int di = (int)d;\
             *  2. Через функции в классе Convert.
             *  Пример:
             *  int a = Convert.ToInt32(Console.WriteLine());
             *  3. Через метод Parse
             *  Пример:
             *  int a = int.Parse(Console.ReadLine());
             */

            /*
             * Операторы языка C#:
             *  1. Арифметические: + - * /
             *  2. Отношений: > < >= <= == !=
             *  3. Присваивания: = *= /= += -=
             *  4. Логитческие: && || !
             */

            /*
             * Условия:
             * if (условие)
             * {
             * 
             * } else if (условие2)
             * {
             * 
             * } else
             * {
             * 
             * }
             * 2. Условный оператор switch.
             * switch (выражине)
             * {
             *         case константа:
             *           операторы 
             *           break;
             *         case константа2:
             *           операторы 
             *           break;
             *         default:
             *         break;
             * }
             * 3. Тернарный оператор.
             * условие ? выражение true : выражение false;
             * a > 5 ? Console.WriteLine("Yes") : console.Writeline("No");
             * a = 10 -> Yes
             * a = 3 -> No
             *         
             */

            /*
             * Циклы.
             * 1. For.(со счетчиком)
             * for (инициализация; условие; шаг) {}
             * Пример: 
             * for (int I = 0; i< 5; i++_
             * {
             *        Console.WriteLine(arr[i]);
             * }
             * 2. While ( с предусловием)
             * while (условие)
             * {
             * } 
             * Сначала проверяется условие, потом выполняется действие.
             * Пример:
             * int i = 0;
             * While (i < 5)
             * { 
             *        Console.WritLine(arr[i]);
             *        i++;
             * }
             * 3. Do While (с постусловием)
             * Сначала делаем потом думаем.
             * Пример:
             * int i = 0;
             * do
             * {
             *       Console.WriteLine(arr[i]);
             *       i++;
             * } while (i < 6) 
             * 4. foreach
             * Пример
             * foreach ( int num int arr)
             * {
             * Console.WriteLine(num);
             * }
             * 
             * 
             */

            /*
             * пользователь вводит числа по порядку.
             * Необходимо вывести в консоль сумму всех чисел пока не вернется пустая строка
             * (пока пользователь не нажмет enter)/
             */
            /*

            -------------------------------------------------------------------------------------------------------------------------------------------------------------------

            Console.WriteLine("Вводите числа через enter. Как только завершится, ставьте entet");
            int sum = 0;
            while (true)
            {
                string str = Console.ReadLine();
                if (str == ""|| str == null)
                {
                    break;
                }
                sum += Convert.ToInt32(str);
            }
            Console.Write("Ответ: ");
            Console.Write(sum);

            -------------------------------------------------------------------------------------------------------------------------------------------------------------------

            */
            /*
            -------------------------------------------------------------------------------------------------------------------------------------------------------------------
            Массивы, строки, перечисления

            Массив - это структура данных, которая представляет собой ряд
            связанных мужду собой данных одного типа
            Программа может обращаться к любому из элементов массива указав его местоположение (индекс)

            Структура данных - это способ организации, хранения и обработки данных

            Массив строго ограничен размером, который был указан при его создании

            Синтаксис создания массива:
            тип_данных[] название = new тип_данных[размер];
            тип_данных[] название;
            тип_данных[] название = new тип_данных[размер] {данные через запятую};

            int[] arr = new int[5];
            Обратиться к элементам массива можно по индексу начиная с нуля
            Т.е элементы массива расположены [0,n) где n - размер массива

            [ - включая
            ) - не включая
            -------------------------------------------------------------------------------------------------------------------------------------------------------------------
            Многомерные массивы
            Многомерный массив - это массив, который может хранить в себе 
            в нескольких измерения. Как правило не больше трёх

            Синтаксис создания многомерного массива:
            тип_данных[,] название = new тип_данных[размер,размер]; 
            чем больше запятых, тем больше мерность

            int[,] arr = new int[3,3] { {1,2,3}, {4,5,6}, {7,8,9} };
            Console.WriteLine(arr[1,2]); //6

            -------------------------------------------------------------------------------------------------------------------------------------------------------------------

            Зубчатые массивы
            Зубчатый массив - это массив, который может внутри себя хранить другие массивы
            В каждой ячейке этого массива хранится одномерный массив

            Синтаксис зубчатого массива:
            тип_данных[][] = new тип_данных[размер(кол-во массивов)][];
            int[][] arr = new int[3][];
            
            arr[0] = new int {1, 2};
            arr[1] = new int {4, 5, 65, 78};
            arr[2] = new int {1};

            -------------------------------------------------------------------------------------------------------------------------------------------------------------------

            Цикл foreach не сильно отличается от цикла for
            По-сути цикл foreach представляет собой цикл for из phyton

            char[] arr = new char[] {'h', 'e', 'l', 'l', 'o'};
            
            for(int i = 0; i < 5; i++ )
            {
                Console.Write(arr[i]);
            }

            foreach(char element in arr)
            {
                Console.Write(element);
            }

            ВАЖНО! Foreach работает только в readonly режиме.
            Т.е внутри этого цикла можно только считывать массив, а не изменять его

            -------------------------------------------------------------------------------------------------------------------------------------------------------------------

            Строки
            Строка - это структура данных, которая представляет собой массив char

            НО в C# string - это ссылочный тип данных, представляющий собой последовательность из нуля
            и более символов в кодировке Unicode

            Строки в C# иммутабеьны
            Иммутабельность - неизменность

            Синтаксис создания строки:
            string имя = "значение";

            string str1 = "Hello ";
            string str2 = "World!";
            string str3 = str1 + str2;

            StringBuilder.
            Т.к строки в C# иммутабельны, частое их изменение может значительно съедать память
            Чтоб решить эту проблему был создан StringBuilder
            StringBuilder представляет собой класс для взаимодействия со строками
            При изменении объекта этого класса не происходит лишних аллокаций памяти, очистки и прочих проблем

            var sb = new StringBuilder();
            sb.Append("hello"); // Добавление строки в конец
            sb.AppendLine(); // Добавление пустой строки к уже существующей
            sb.Remove(); // Удаляет диапазон символов
            sb.ToString(); // Приводит к формату обычной строки (string)

            -------------------------------------------------------------------------------------------------------------------------------------------------------------------

            Перечисление ( enums )
            Enum - это непустой список именованных констант. Перечисления являются классом.

            Синтаксис: 
            enum название {переменные через запятую}
            
            Пример:

            enum DaysofWeek
            {
                Monday,
                Tuseday,
                Wednesday,
                Thirsday,
                Friday,
                Saturday,
                Sunday,   
            }


            */

        }
    }
}
